In [1]:
import pandas as pd
import numpy as np
import pandas as pd
import numpy as np
import itertools as it
import json
import re
import env
from collections import Counter
from pydataset import data

np.random.seed(123)

## Exercises III

### 1. Use your `get_db_url` function to help you explore the data from the `chipotle` database.

In [2]:
df = pd.read_csv('chipotle___orders.csv')

In [3]:
df.drop(columns='id',inplace=True)

In [4]:
df

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",$8.75

### 2. What is the total price for each order?

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [6]:
df['item_price'] = df['item_price'].str.replace('$','')

/var/folders/ty/2pnn6wsj06n_glzjgbmxzlkw0000gn/T/ipykernel_10074/3406535628.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['item_price'] = df['item_price'].str.replace('$','')

In [7]:
df['item_price']

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
         ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: object

In [8]:
df['item_price'] = df['item_price'].apply(pd.to_numeric,errors='ignore')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   float64
dtypes: float64(1), int64(2), object(2)
memory usage: 180.7+ KB

In [10]:
df.groupby('order_id').item_price.sum()

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: item_price, Length: 1834, dtype: float64

In [11]:
order_totals = df.groupby('order_id').item_price.sum()

In [12]:
pd.DataFrame(order_totals)

          item_price
order_id
1              11.56
2              16.98
3              12.67
4              21.00
5              13.70
...              ...
1830           23.00
1831           12.90
1832           13.20
1833           23.50
1834           28.75

[1834 rows x 1 columns]

### 3. What are the most popular 3 items?

In [13]:
item_names = df.groupby('item_name').item_name.count()

In [14]:
df_pivot = pd.DataFrame(item_names)

In [15]:
df_pivot

                                       item_name
item_name
6 Pack Soft Drink                             54
Barbacoa Bowl                                 66
Barbacoa Burrito                              91
Barbacoa Crispy Tacos                         11
Barbacoa Salad Bowl                           10
Barbacoa Soft Tacos                           25
Bottled Water                                162
Bowl                                           2
Burrito                                        6
Canned Soda                                  104
Canned Soft Drink                            301
Carnitas Bowl                                 68
Carnitas Burrito                              59
Carnitas Crispy Tacos                          7
Carnitas Salad                                 1
Carnitas Salad Bowl                            6
Carnitas Soft Tacos                           40
Chicken Bowl                                 726
Chicken Burrito                              553
Chicken Crispy Tacos                          47
Chicken Salad                                  9
Chicken Salad Bowl                           110
Chicken Soft Tacos                           115
Chips                                        211
Chips and Fresh Tomato Salsa                 110
Chips and Guacamole                          479
Chips and Mild Fresh Tomato Salsa              1
Chips and Roasted Chili Corn Salsa            22
Chips and Roasted Chili-Corn Salsa            18
Chips and Tomatillo Green Chili Salsa         43
Chips and Tomatillo Red Chili Salsa           48
Chips and Tomatillo-Green Chili Salsa         31
Chips and Tomatillo-Red Chili Salsa           20
Crispy Tacos                                   2
Izze                                          20
Nantucket Nectar                              27
Salad                                          2
Side of Chips                                101
Steak Bowl                                   211
Steak Burrito                                368
Steak Crispy Tacos                            35
Steak Salad                                    4
Steak Salad Bowl                              29
Steak Soft Tacos                              55
Veggie Bowl                                   85
Veggie Burrito                                95
Veggie Crispy Tacos                            1
Veggie Salad                                   6
Veggie Salad Bowl                             18
Veggie Soft Tacos                              7

In [16]:
df_pivot.columns

Index(['item_name'], dtype='object')

In [17]:
new_cols = ['total']
df_pivot.columns = new_cols

In [18]:
df_pivot.sort_values(by='total',ascending=False).head(3)

                     total
item_name
Chicken Bowl           726
Chicken Burrito        553
Chips and Guacamole    479

### 4. Which item has produced the most revenue?

In [19]:
total_sales_by_item = df.groupby('item_name').item_price.sum()

In [20]:
df_pivot = pd.DataFrame(total_sales_by_item)

In [21]:
df_pivot

                                       item_price
item_name
6 Pack Soft Drink                          356.95
Barbacoa Bowl                              672.36
Barbacoa Burrito                           894.75
Barbacoa Crispy Tacos                      120.21
Barbacoa Salad Bowl                        106.40
Barbacoa Soft Tacos                        250.46
Bottled Water                              302.56
Bowl                                        29.60
Burrito                                     44.40
Canned Soda                                137.34
Canned Soft Drink                          438.75
Carnitas Bowl                              736.71
Carnitas Burrito                           597.83
Carnitas Crispy Tacos                       77.96
Carnitas Salad                               8.99
Carnitas Salad Bowl                         66.34
Carnitas Soft Tacos                        375.94
Chicken Bowl                              7342.73
Chicken Burrito                           5575.82
Chicken Crispy Tacos                       472.13
Chicken Salad                               81.09
Chicken Salad Bowl                        1228.75
Chicken Soft Tacos                        1108.09
Chips                                      494.34
Chips and Fresh Tomato Salsa               361.36
Chips and Guacamole                       2201.04
Chips and Mild Fresh Tomato Salsa            3.00
Chips and Roasted Chili Corn Salsa          67.85
Chips and Roasted Chili-Corn Salsa          43.02
Chips and Tomatillo Green Chili Salsa      132.75
Chips and Tomatillo Red Chili Salsa        147.50
Chips and Tomatillo-Green Chili Salsa       78.87
Chips and Tomatillo-Red Chili Salsa         59.75
Crispy Tacos                                14.80
Izze                                        67.80
Nantucket Nectar                            98.31
Salad                                       14.80
Side of Chips                              185.90
Steak Bowl                                2260.19
Steak Burrito                             3851.43
Steak Crispy Tacos                         357.34
Steak Salad                                 35.66
Steak Salad Bowl                           343.59
Steak Soft Tacos                           536.05
Veggie Bowl                                867.99
Veggie Burrito                             934.77
Veggie Crispy Tacos                          8.49
Veggie Salad                                50.94
Veggie Salad Bowl                          182.50
Veggie Soft Tacos                           73.96

In [22]:
df_pivot.sort_values(by='item_price',ascending=False).head(10)

                     item_price
item_name
Chicken Bowl            7342.73
Chicken Burrito         5575.82
Steak Burrito           3851.43
Steak Bowl              2260.19
Chips and Guacamole     2201.04
Chicken Salad Bowl      1228.75
Chicken Soft Tacos      1108.09
Veggie Burrito           934.77
Barbacoa Burrito         894.75
Veggie Bowl              867.99

### 5. Join the `employees` and `titles` DataFrames together.

In [23]:
df_emp = pd.read_csv('employees___employees.csv')
df_title = pd.read_csv('employees___titles.csv')

In [24]:
df_emp

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [25]:
df_title

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [26]:
df_merged_title = df_title.merge(df_emp,on='emp_no')

In [27]:
df_merged_title

,emp_no,title,from_date,to_date,birth_date,first_name,last_name,gender,hire_date
0,10001,Senior Engineer,1986-06-26,9999-01-01,1953-09-02,Georgi,Facello,M,1986-06-26
1,10002,Staff,1996-08-03,9999-01-01,1964-06-02,Bezalel,Simmel,F,1985-11-21
2,10003,Senior Engineer,1995-12-03,9999-01-01,1959-12-03,Parto,Bamford,M,1986-08-28
3,10004,Engineer,1986-12-01,1995-12-01,1954-05-01,Chirstian,Koblick,M,1986-12-01
4,10004,Senior Engineer,1995-12-01,9999-01-01,1954-05-01,Chirstian,Koblick,M,1986-12-01
...,...,...,...,...,...,...,...,...,...
443303,499997,Engineer,1987-08-30,1992-08-29,1961-08-03,Berhard,Lenart,M,1986-04-21
443304,499997,Senior Engineer,1992-08-29,9999-01-01,1961-08-03,Berhard,Lenart,M,1986-04-21
443305,499998,Senior Staff,1998-12-27,9999-01-01,1956-09-05,Patricia,Breugel,M,1993-10-13
443306,499998,Staff,1993-12-27,1998-12-27,1956-09-05,Patricia,Breugel,M,1993-10-13
443307,499999,Engineer,1997-11-30,9999-01-01,1958-05-01,Sachin,Tsukuda,M,1997-11-30

### 6. For each title, find the hire date of the employee that was hired most recently with that title.

In [28]:
df_merged_title.groupby('title').agg(
    total = ('title','count'),
    latest_hire = ('hire_date','max'))

                     total latest_hire
title
Assistant Engineer   15128  1999-12-24
Engineer            115003  2000-01-28
Manager                 24  1992-02-05
Senior Engineer      97750  2000-01-01
Senior Staff         92853  2000-01-13
Staff               107391  2000-01-12
Technique Leader     15159  1999-12-31

### 7. Write the code necessary to create a cross tabulation of the number of titles by department.

In [29]:
df_dept_emp = pd.read_csv('employees___dept_emp.csv')
df_dept_names = pd.read_csv('employees___departments.csv')

In [30]:
df_dept_emp

        emp_no dept_no   from_date     to_date
0        10001    d005  1986-06-26  9999-01-01
1        10002    d007  1996-08-03  9999-01-01
2        10003    d004  1995-12-03  9999-01-01
3        10004    d004  1986-12-01  9999-01-01
4        10005    d003  1989-09-12  9999-01-01
...        ...     ...         ...         ...
331598  499995    d004  1997-06-02  9999-01-01
331599  499996    d004  1996-05-13  9999-01-01
331600  499997    d005  1987-08-30  9999-01-01
331601  499998    d002  1993-12-27  9999-01-01
331602  499999    d004  1997-11-30  9999-01-01

[331603 rows x 4 columns]

In [31]:
df_dept_emp = df_dept_emp[df_dept_emp['to_date']=='9999-01-01']

In [32]:
df_merged_title = df_merged_title[df_merged_title['to_date'] == '9999-01-01']

In [33]:
df_merged_title

,emp_no,title,from_date,to_date,birth_date,first_name,last_name,gender,hire_date
0,10001,Senior Engineer,1986-06-26,9999-01-01,1953-09-02,Georgi,Facello,M,1986-06-26
1,10002,Staff,1996-08-03,9999-01-01,1964-06-02,Bezalel,Simmel,F,1985-11-21
2,10003,Senior Engineer,1995-12-03,9999-01-01,1959-12-03,Parto,Bamford,M,1986-08-28
4,10004,Senior Engineer,1995-12-01,9999-01-01,1954-05-01,Chirstian,Koblick,M,1986-12-01
5,10005,Senior Staff,1996-09-12,9999-01-01,1955-01-21,Kyoichi,Maliniak,M,1989-09-12
...,...,...,...,...,...,...,...,...,...
443300,499995,Engineer,1997-06-02,9999-01-01,1958-09-24,Dekang,Lichtner,F,1993-01-12
443302,499996,Senior Engineer,2002-05-13,9999-01-01,1953-03-07,Zito,Baaz,M,1990-09-27
443304,499997,Senior Engineer,1992-08-29,9999-01-01,1961-08-03,Berhard,Lenart,M,1986-04-21
443305,499998,Senior Staff,1998-12-27,9999-01-01,1956-09-05,Patricia,Breugel,M,1993-10-13
443307,499999,Engineer,1997-11-30,9999-01-01,1958-05-01,Sachin,Tsukuda,M,1997-11-30

In [34]:
df_merged_title_dept = df_merged_title.merge(df_dept_emp,on=['emp_no'])

In [35]:
df_merged_title_dept

,emp_no,title,from_date_x,to_date_x,birth_date,first_name,last_name,gender,hire_date,dept_no,from_date_y,to_date_y
0,10001,Senior Engineer,1986-06-26,9999-01-01,1953-09-02,Georgi,Facello,M,1986-06-26,d005,1986-06-26,9999-01-01
1,10002,Staff,1996-08-03,9999-01-01,1964-06-02,Bezalel,Simmel,F,1985-11-21,d007,1996-08-03,9999-01-01
2,10003,Senior Engineer,1995-12-03,9999-01-01,1959-12-03,Parto,Bamford,M,1986-08-28,d004,1995-12-03,9999-01-01
3,10004,Senior Engineer,1995-12-01,9999-01-01,1954-05-01,Chirstian,Koblick,M,1986-12-01,d004,1986-12-01,9999-01-01
4,10005,Senior Staff,1996-09-12,9999-01-01,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,d003,1989-09-12,9999-01-01
...,...,...,...,...,...,...,...,...,...,...,...,...
240119,499995,Engineer,1997-06-02,9999-01-01,1958-09-24,Dekang,Lichtner,F,1993-01-12,d004,1997-06-02,9999-01-01
240120,499996,Senior Engineer,2002-05-13,9999-01-01,1953-03-07,Zito,Baaz,M,1990-09-27,d004,1996-05-13,9999-01-01
240121,499997,Senior Engineer,1992-08-29,9999-01-01,1961-08-03,Berhard,Lenart,M,1986-04-21,d005,1987-08-30,9999-01-01
240122,499998,Senior Staff,1998-12-27,9999-01-01,1956-09-05,Patricia,Breugel,M,1993-10-13,d002,1993-12-27,9999-01-01
240123,499999,Engineer,1997-11-30,9999-01-01,1958-05-01,Sachin,Tsukuda,M,1997-11-30,d004,1997-11-30,9999-01-01

In [36]:
columns = ['emp_no','title','to_date_x','dept_no']
df_merged_title_dept = df_merged_title_dept[columns]

In [37]:
df_merged_title_dept

        emp_no            title   to_date_x dept_no
0        10001  Senior Engineer  9999-01-01    d005
1        10002            Staff  9999-01-01    d007
2        10003  Senior Engineer  9999-01-01    d004
3        10004  Senior Engineer  9999-01-01    d004
4        10005     Senior Staff  9999-01-01    d003
...        ...              ...         ...     ...
240119  499995         Engineer  9999-01-01    d004
240120  499996  Senior Engineer  9999-01-01    d004
240121  499997  Senior Engineer  9999-01-01    d005
240122  499998     Senior Staff  9999-01-01    d002
240123  499999         Engineer  9999-01-01    d004

[240124 rows x 4 columns]

In [38]:
df_merged_title_dept.groupby('dept_no').agg(
    total = ('title','count'))

         total
dept_no
d001     14842
d002     12437
d003     12898
d004     53304
d005     61386
d006     14546
d007     37701
d008     15441
d009     17569

In [39]:
pivot = df_merged_title_dept.groupby('dept_no').agg(
    total = ('title','count'))

In [40]:
df_dept_names

  dept_no           dept_name
0    d009    Customer Service
1    d005         Development
2    d002             Finance
3    d003     Human Resources
4    d001           Marketing
5    d004          Production
6    d006  Quality Management
7    d008            Research
8    d007               Sales

In [41]:
dept_counts = pivot.merge(df_dept_names,on=['dept_no'])

In [44]:
pivot_cols = ['dept_no','dept_name','total']
dept_counts = dept_counts[pivot_cols]
dept_counts

  dept_no           dept_name  total
0    d001           Marketing  14842
1    d002             Finance  12437
2    d003     Human Resources  12898
3    d004          Production  53304
4    d005         Development  61386
5    d006  Quality Management  14546
6    d007               Sales  37701
7    d008            Research  15441
8    d009    Customer Service  17569